## Staging: s3
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| update | `aws_s3_bucket.archive_storage`                              |
|        | `aws_s3_bucket.reliability_file_storage`                     |
|        | `aws_s3_bucket.vault_file_storage`                           |
| add    | `aws_s3_bucket.lambda_code`                                  |
|        | `aws_s3_bucket_public_access_block.archive_storage`          |
|        | `aws_s3_bucket_public_access_block.lambda_code`              |
|        | `aws_s3_bucket_public_access_block.reliability_file_storage` |
|        | `aws_s3_bucket_public_access_block.vault_file_storage`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.archive_storage will be updated in-place
  # (imported from "forms-staging-archive-storage")
  ~ resource "aws_s3_bucket" "archive_storage" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::forms-staging-archive-storage"
        bucket                      = "forms-staging-archive-storage"
        bucket_domain_name          = "forms-staging-archive-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-staging-archive-storage.s3.ca-central-1.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-staging-archive-storage"
        object_lock_enabled         = false
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        tags_all                    = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }

        lifecycle_rule {
            abort_incomplete_multipart_upload_days = 0
            enabled                                = true
            id                                     = "tf-s3-lifecycle-20210817191835250600000001"
            tags                                   = {}

            expiration {
                days                         = 30
                expired_object_delete_marker = false
            }
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_bucket.lambda_code will be created
  + resource "aws_s3_bucket" "lambda_code" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-staging-lambda-code"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket.reliability_file_storage will be updated in-place
  # (imported from "forms-staging-reliability-file-storage")
  ~ resource "aws_s3_bucket" "reliability_file_storage" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::forms-staging-reliability-file-storage"
        bucket                      = "forms-staging-reliability-file-storage"
        bucket_domain_name          = "forms-staging-reliability-file-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-staging-reliability-file-storage.s3.ca-central-1.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-staging-reliability-file-storage"
        object_lock_enabled         = false
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        tags_all                    = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }

        lifecycle_rule {
            abort_incomplete_multipart_upload_days = 0
            enabled                                = true
            id                                     = "tf-s3-lifecycle-20210817191835262200000002"
            tags                                   = {}

            expiration {
                days                         = 30
                expired_object_delete_marker = false
            }
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # aws_s3_bucket.vault_file_storage will be updated in-place
  # (imported from "forms-staging-vault-file-storage")
  ~ resource "aws_s3_bucket" "vault_file_storage" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::forms-staging-vault-file-storage"
        bucket                      = "forms-staging-vault-file-storage"
        bucket_domain_name          = "forms-staging-vault-file-storage.s3.amazonaws.com"
        bucket_regional_domain_name = "forms-staging-vault-file-storage.s3.ca-central-1.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z1QDHH18159H29"
        id                          = "forms-staging-vault-file-storage"
        object_lock_enabled         = false
        region                      = "ca-central-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        tags_all                    = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }

        server_side_encryption_configuration {
            rule {
                bucket_key_enabled = false

                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = true
            mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.archive_storage will be created
  + resource "aws_s3_bucket_public_access_block" "archive_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-staging-archive-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.lambda_code will be created
  + resource "aws_s3_bucket_public_access_block" "lambda_code" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.reliability_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "reliability_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-staging-reliability-file-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_public_access_block.vault_file_storage will be created
  + resource "aws_s3_bucket_public_access_block" "vault_file_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = "forms-staging-vault-file-storage"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 3 to import, 5 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + archive_storage_arn          = "arn:aws:s3:::forms-staging-archive-storage"
  + archive_storage_id           = "forms-staging-archive-storage"
  + lambda_code_arn              = (known after apply)
  + lambda_code_id               = (known after apply)
  + reliability_file_storage_arn = "arn:aws:s3:::forms-staging-reliability-file-storage"
  + reliability_file_storage_id  = "forms-staging-reliability-file-storage"
  + vault_file_storage_arn       = "arn:aws:s3:::forms-staging-vault-file-storage"
  + vault_file_storage_id        = "forms-staging-vault-file-storage"

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
